zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/periph/PERI_SIM.h
#define SIM_XBAR_FLT0_XBAR_IN3_FIL_CNT_MASK      (0xE000U)
#define SIM_XBAR_FLT0_XBAR_IN3_FIL_CNT_SHIFT     (13U)
/*! XBAR_IN3_FIL_CNT - Input Filter Sample Count */
#define SIM_XBAR_FLT0_XBAR_IN3_FIL_CNT(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT0_XBAR_IN3_FIL_CNT_SHIFT)) & SIM_XBAR_FLT0_XBAR_IN3_FIL_CNT_MASK)
/*! @} */

/*! @name XBAR_FLT1 - XBAR Input Filter Control Register 1 */
/*! @{ */

#define SIM_XBAR_FLT1_XBAR_IN4_FIL_PER_MASK      (0x1FU)
#define SIM_XBAR_FLT1_XBAR_IN4_FIL_PER_SHIFT     (0U)
/*! XBAR_IN4_FIL_PER - Input Filter Sample Period */
#define SIM_XBAR_FLT1_XBAR_IN4_FIL_PER(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT1_XBAR_IN4_FIL_PER_SHIFT)) & SIM_XBAR_FLT1_XBAR_IN4_FIL_PER_MASK)

#define SIM_XBAR_FLT1_XBAR_IN4_FIL_CNT_MASK      (0xE0U)
#define SIM_XBAR_FLT1_XBAR_IN4_FIL_CNT_SHIFT     (5U)
/*! XBAR_IN4_FIL_CNT - Input Filter Sample Count */
#define SIM_XBAR_FLT1_XBAR_IN4_FIL_CNT(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT1_XBAR_IN4_FIL_CNT_SHIFT)) & SIM_XBAR_FLT1_XBAR_IN4_FIL_CNT_MASK)

#define SIM_XBAR_FLT1_XBAR_IN5_FIL_PER_MASK      (0x1F00U)
#define SIM_XBAR_FLT1_XBAR_IN5_FIL_PER_SHIFT     (8U)
/*! XBAR_IN5_FIL_PER - Input Filter Sample Period */
#define SIM_XBAR_FLT1_XBAR_IN5_FIL_PER(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT1_XBAR_IN5_FIL_PER_SHIFT)) & SIM_XBAR_FLT1_XBAR_IN5_FIL_PER_MASK)

#define SIM_XBAR_FLT1_XBAR_IN5_FIL_CNT_MASK      (0xE000U)
#define SIM_XBAR_FLT1_XBAR_IN5_FIL_CNT_SHIFT     (13U)
/*! XBAR_IN5_FIL_CNT - Input Filter Sample Count */
#define SIM_XBAR_FLT1_XBAR_IN5_FIL_CNT(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT1_XBAR_IN5_FIL_CNT_SHIFT)) & SIM_XBAR_FLT1_XBAR_IN5_FIL_CNT_MASK)
/*! @} */

/*! @name XBAR_FLT2 - XBAR Input Filter Control Register 2 */
/*! @{ */

#define SIM_XBAR_FLT2_XBAR_IN6_FIL_PER_MASK      (0x1FU)
#define SIM_XBAR_FLT2_XBAR_IN6_FIL_PER_SHIFT     (0U)
/*! XBAR_IN6_FIL_PER - Input Filter Sample Period */
#define SIM_XBAR_FLT2_XBAR_IN6_FIL_PER(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT2_XBAR_IN6_FIL_PER_SHIFT)) & SIM_XBAR_FLT2_XBAR_IN6_FIL_PER_MASK)

#define SIM_XBAR_FLT2_XBAR_IN6_FIL_CNT_MASK      (0xE0U)
#define SIM_XBAR_FLT2_XBAR_IN6_FIL_CNT_SHIFT     (5U)
/*! XBAR_IN6_FIL_CNT - Input Filter Sample Count */
#define SIM_XBAR_FLT2_XBAR_IN6_FIL_CNT(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT2_XBAR_IN6_FIL_CNT_SHIFT)) & SIM_XBAR_FLT2_XBAR_IN6_FIL_CNT_MASK)

#define SIM_XBAR_FLT2_XBAR_IN7_FIL_PER_MASK      (0x1F00U)
#define SIM_XBAR_FLT2_XBAR_IN7_FIL_PER_SHIFT     (8U)
/*! XBAR_IN7_FIL_PER - Input Filter Sample Period */
#define SIM_XBAR_FLT2_XBAR_IN7_FIL_PER(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT2_XBAR_IN7_FIL_PER_SHIFT)) & SIM_XBAR_FLT2_XBAR_IN7_FIL_PER_MASK)

#define SIM_XBAR_FLT2_XBAR_IN7_FIL_CNT_MASK      (0xE000U)
#define SIM_XBAR_FLT2_XBAR_IN7_FIL_CNT_SHIFT     (13U)
/*! XBAR_IN7_FIL_CNT - Input Filter Sample Count */
#define SIM_XBAR_FLT2_XBAR_IN7_FIL_CNT(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT2_XBAR_IN7_FIL_CNT_SHIFT)) & SIM_XBAR_FLT2_XBAR_IN7_FIL_CNT_MASK)
/*! @} */

/*! @name XBAR_FLT3 - XBAR Input Filter Control Register 3 */
/*! @{ */

#define SIM_XBAR_FLT3_XBAR_IN8_FIL_PER_MASK      (0x1FU)
#define SIM_XBAR_FLT3_XBAR_IN8_FIL_PER_SHIFT     (0U)
/*! XBAR_IN8_FIL_PER - Input Filter Sample Period */
#define SIM_XBAR_FLT3_XBAR_IN8_FIL_PER(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT3_XBAR_IN8_FIL_PER_SHIFT)) & SIM_XBAR_FLT3_XBAR_IN8_FIL_PER_MASK)

#define SIM_XBAR_FLT3_XBAR_IN8_FIL_CNT_MASK      (0xE0U)
#define SIM_XBAR_FLT3_XBAR_IN8_FIL_CNT_SHIFT     (5U)
/*! XBAR_IN8_FIL_CNT - Input Filter Sample Count */
#define SIM_XBAR_FLT3_XBAR_IN8_FIL_CNT(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT3_XBAR_IN8_FIL_CNT_SHIFT)) & SIM_XBAR_FLT3_XBAR_IN8_FIL_CNT_MASK)

#define SIM_XBAR_FLT3_XBAR_IN9_FIL_PER_MASK      (0x1F00U)
#define SIM_XBAR_FLT3_XBAR_IN9_FIL_PER_SHIFT     (8U)
/*! XBAR_IN9_FIL_PER - Input Filter Sample Period */
#define SIM_XBAR_FLT3_XBAR_IN9_FIL_PER(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT3_XBAR_IN9_FIL_PER_SHIFT)) & SIM_XBAR_FLT3_XBAR_IN9_FIL_PER_MASK)

#define SIM_XBAR_FLT3_XBAR_IN9_FIL_CNT_MASK      (0xE000U)
#define SIM_XBAR_FLT3_XBAR_IN9_FIL_CNT_SHIFT     (13U)
/*! XBAR_IN9_FIL_CNT - Input Filter Sample Count */
#define SIM_XBAR_FLT3_XBAR_IN9_FIL_CNT(x)        (((uint16_t)(((uint16_t)(x)) << SIM_XBAR_FLT3_XBAR_IN9_FIL_CNT_SHIFT)) & SIM_XBAR_FLT3_XBAR_IN9_FIL_CNT_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SIM_Register_Masks */


/*!
 * @}
 */ /* end of group SIM_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SIM_H_ */

